conf/src/BusinessProcesses/ЭП_Заявки/ЭП_Заявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ЭП_Заявки</name>
  <task>Task.ЭП_ЗадачиЗаявок</task>
  <attributes>
    <name>ТипЗаявки</name>
    <type>
      <types>EnumRef.ЭП_ТипЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорГПХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.ЭП_Сервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧтоЯХочу</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧтоЯДелаю</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧтоЯПолучаю</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.ЭП_СтатусыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласиеНаВыполнениеЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>EnumRef.ЭП_ИсполнителиЗаявок</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Контролирующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Удовлетворительно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПротоколВзаимодействия</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстСообщения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительЗадачи</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.ЭП_СтатусыЗаявок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредоставляемаяТехника</name>
    <attributes>
      <name>Техника</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ЭП_ВидыТехникиДляЗаявок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

conf/src/InformationRegisters/ЭП_НастройкиАдресацииДляВыполненияЗаявок/ЭП_НастройкиАдресацииДляВыполненияЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_НастройкиАдресацииДляВыполненияЗаявок</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипУчастникаЗаявок</name>
    <type>
      <types>EnumRef.ЭП_ИсполнителиЗаявок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Enums/ЭП_СтатусыЗаявок/ЭП_СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭП_СтатусыЗаявок</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>ВОчереди</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>НаПроверке</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтмену</name>
  </enumValues>
</mdclass:Enum>

conf/src/Enums/ЭП_ИсполнителиЗаявок/ЭП_ИсполнителиЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭП_ИсполнителиЗаявок</name>
  <enumValues>
    <name>ОтветственныйЗаСогласованиеЗаявок</name>
  </enumValues>
  <enumValues>
    <name>ГлавныйСистемныйАдминистратор</name>
  </enumValues>
  <enumValues>
    <name>СистемныйАдминистратор</name>
  </enumValues>
</mdclass:Enum>

conf/src/BusinessProcesses/ЭП_Заявки/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
	
	Заявитель = ПользователиКлиентСервер.ТекущийПользователь();    
	СтатусЗаявки = Перечисления.ЭП_СтатусыЗаявок.Новая;
	НаборЗаписей= РегистрыСведений.ЭП_НастройкиАдресацииДляВыполненияЗаявок.СоздатьНаборЗаписей();     
	НаборЗаписей.Отбор.ТипУчастникаЗаявок.Установить(Перечисления.ЭП_ИсполнителиЗаявок.ГлавныйСистемныйАдминистратор);
	НаборЗаписей.Прочитать();
	Для Каждого Элемент Из НаборЗаписей Цикл 
		Контролирующий =  Элемент.Пользователь;
	КонецЦикла; 
	
КонецПроцедуры

Процедура ТипЗаявкиПодкллючениеККонтуруПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)  
	
	//Результат = ?(ТипЗаявки = Перечисления.ЭП_ТипЗаявки.ПредоставлениеДоступаККонтуру, ИСТИНА, ЛОЖЬ);  
	Результат = Ложь;
КонецПроцедуры

Процедура ДоговорГПХПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)  
	
	Результат = Сотрудник.ДоговорГПХ;  
	
КонецПроцедуры

Процедура УдовлетворительноПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат) 
	
	Результат = Удовлетворительно;  
	
КонецПроцедуры

Процедура СогласиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)  
	
	Результат = СогласиеНаВыполнениеЗаявки; 
	
КонецПроцедуры

Процедура ВыполнениеЗаявкиПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭП_ЗадачиЗаявок.Ссылка КАК ЗадачаСсылка
	|ИЗ
	|	Задача.ЭП_ЗадачиЗаявок КАК ЭП_ЗадачиЗаявок
	|ГДЕ
	|	ЭП_ЗадачиЗаявок.БизнесПроцесс = &БизнесПроцесс
	|	И ЭП_ЗадачиЗаявок.Наименование = ""Выполнение Заявки"""; 
	Запрос.УстановитьПараметр("БизнесПроцесс", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда  
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗадачаСсылка = Выборка.ЗадачаСсылка;
		ЗадачаОб = ЗадачаСсылка.ПолучитьОбъект();
		ЗадачаОб.Выполнена = Ложь;
		ЗадачаОб.Записать();
		ФормируемыеЗадачи.Удалить(0);
		ФормируемыеЗадачи.Добавить(ЗадачаОб);
		СтатусЗаявки = Перечисления.ЭП_СтатусыЗаявок.ВРаботе;
		Исполнитель = ФормируемыеЗадачи[0].Исполнитель;
	Иначе
		СтатусЗаявки = Перечисления.ЭП_СтатусыЗаявок.ВОчереди;
		Исполнитель = ФормируемыеЗадачи[0].Отдел;
	КонецЕсли;
    Записать();
		
КонецПроцедуры

Процедура СогласованиеРППриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) 
	
	РуководительПроект =  Проект.Ответственный;
	Задача = ФормируемыеЗадачи[0];  
	Задача.Исполнитель = РуководительПроект;
	Задача.Записать();
	СтатусЗаявки = Перечисления.ЭП_СтатусыЗаявок.НаСогласовании;
	Исполнитель = РуководительПроект;
    Записать();
	
КонецПроцедуры

Процедура СогласованиеГДПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	СтатусЗаявки = Перечисления.ЭП_СтатусыЗаявок.НаСогласовании; 
	Исполнитель = Перечисления.ЭП_ИсполнителиЗаявок.ОтветственныйЗаСогласованиеЗаявок;
    Записать();

КонецПроцедуры 

Процедура ОбратнаяСвязьПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭП_ЗадачиЗаявок.Ссылка КАК ЗадачаСсылка
	|ИЗ
	|	Задача.ЭП_ЗадачиЗаявок КАК ЭП_ЗадачиЗаявок
	|ГДЕ
	|	ЭП_ЗадачиЗаявок.БизнесПроцесс = &БизнесПроцесс
	|	И ЭП_ЗадачиЗаявок.Наименование = ""ОбратнаяСвязь"""; 
	Запрос.УстановитьПараметр("БизнесПроцесс", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда  
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗадачаСсылка = Выборка.ЗадачаСсылка;
		ЗадачаОб = ЗадачаСсылка.ПолучитьОбъект();
		ЗадачаОб.Выполнена = Ложь;
		ЗадачаОб.Записать();
		ФормируемыеЗадачи.Удалить(0);
		ФормируемыеЗадачи.Добавить(ЗадачаОб);
	КонецЕсли; 

КонецПроцедуры
